Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91x1.c
/* Nordic nRF91x1 NR+ PHY driver
 *
 * Copyright (c) 2026 Deveritec GmbH
 * Copyright (c) 2026 Codium Electronique
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT dectnrp_driver_nrf91

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(dectnrp_nrf91x1, CONFIG_DECTNRP_DRIVER_NRF91X1_LOG_LEVEL);

#include <ncs_version.h>
#include <zephyr/types.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/util.h>
#include <zephyr/net/net_time.h>
#include <zephyr/net/net_pkt.h>
#include <zephyr/net/net_log.h>
#include <modem/nrf_modem_lib.h>
#include <nrf_modem_dect_phy.h>
#include <nrf_modem_at.h>
#include <zephyr/net/dectnrp_driver.h>

#if NCS_VERSION_NUMBER < 0x30000
#error "Your nrf ncs version " NCS_VERSION_STRING " is too old, >= 0x30000 expected!"
#endif /* NCS_VERSION_NUMBER */

#define MS_2_MODEM_TICKS(MS)  (MS * NRF_MODEM_DECT_MODEM_TIME_TICK_RATE_KHZ)
#define FRAME_MODEM_TIME_TICK MS_2_MODEM_TICKS(10)

/**
 * @brief Enumerates supported MFW versions.
 */
enum nrf91x1_mfw_version {
	RADIO_MFW_UNKNOWN = 0,
	RADIO_MFW_PHY_1_1_0,
	RADIO_MFW_PHY_2_0_0,
};

/**
 * @brief Enumerates common states of this driver.
 */
enum nrf91x1_state {
	RADIO_STATE_UNKNOWN = 0x0,
	RADIO_STATE_INITIALIZED = 0x1,
	RADIO_STATE_STARTED = 0x2,
};

/**
 * @brief Enumerates rx states of this driver.
 *
 * This is a temporarily solution.
 */
enum nrf91x1_rx_state {
	RADIO_RXSTATE_UNKNOWN = 0x0,
	RADIO_RXSTATE_PCC = 0x1,
	RADIO_RXSTATE_PDC = 0x2,
};

/**
 * @brief The context related to the one and only open nrf91x1 radio device.
 */
struct nrf91x1_context {

	/** Interface related to this nrf91x1 radio device. */
	struct net_if *iface;
	/** Semaphore to lock radio for atomar transactions. */
	struct k_sem modemlock;
	/** Semaphore to lock radio for operations. */
	struct k_sem operation;
	/** State of this nrf91x1 radio device. */
	atomic_t state;

	/** Marks the modem firmware version. */
	enum nrf91x1_mfw_version mfw_version;
	/** Limit of the modem temperature. */
	int16_t temperature_limit;
	/** Status of last modem transaction. */
	struct {
		enum nrf_modem_dect_phy_err last_status;
		uint64_t time;
		int16_t temperature;
		uint16_t voltage;
		uint8_t mu;
		uint8_t beta;
	} modem;

	/** Configured network-id. */
	uint32_t network_id;
	/** Registered handler to notify upper layer. */
	dectnrp_driver_event_cb_t upper_layer_event_handler;

	struct {
		uint16_t count;
	} tx;

	struct {
		atomic_t state;
		uint16_t count;
		uint16_t transaction_id;
		struct nrf_modem_dect_phy_pcc_event pcc_event;
		uint32_t crc_errors_phy_header;
		uint32_t crc_errors_data;

		struct {
			uint8_t short_network_id_active: 1;
			uint32_t short_network_id;
			uint8_t short_addr_active: 1;
			uint16_t short_addr;
		} filter;
	} rx;
};

/** Singleton device needed to back-reference the context from modem callbacks. */
static const struct device *nrf91x1_dev = NULL;

/**
 * @brief Convert Nordic specific RSSI2 value @p rssi2 (Q14.1 format)
 * into format according to @ref ETSI TS 103 636-2 chapter 8.3.
 *
 * @param rssi2
 * @return uint8_t
 */
static inline uint8_t dectnrp_nrf91x1_encode_rssi2(int16_t rssi2)
{
	rssi2 = rssi2 >> 1;

	if (rssi2 > -1) {
		return 0xff;
	}

	if (rssi2 < -140) {
		return 0x74;
	}

	return (uint8_t)(0x00ff & rssi2);
}

/**
 * @brief Convert Nordic specific SNR value @p snr (Q13.2 format)
 * into format according to @ref ETSI TS 103 636-2 chapter 8.4.
 *
 * @param snr
 * @return int8_t
 */
static inline int8_t dectnrp_nrf91x1_encode_snr(int16_t snr)
{
	int16_t snr_q_14_1 = (snr + 1) >> 1;

	if (snr_q_14_1 > 0x7f) {
		return 0x7f;
	}

	if (snr_q_14_1 < (int16_t)0xffffffe0) {
		return 0xe0;
	}

	return (int8_t)(snr_q_14_1 & 0x00ff);
}

/**
 * @brief Event callback returning the state after modem initialization by nrf_modem_dect_phy_init.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_INIT' event.
 */
static void modem_init_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			  const struct nrf_modem_dect_phy_init_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_INIT,%dV,%u°C,max=%u°C", *time, event->voltage, event->temp,
			event->temperature_limit);
	} else {
		LOG_ERR("<%lld> PHY_EVT_INIT failed,0x%x", *time, event->err);
	}
	ctx->temperature_limit = event->temperature_limit;
	// TODO Check temperature regularly and switch off when exceeding temperature_limit!
	// Otherwise you'll kill your transmitter!
	ctx->modem.time = *time;
	ctx->modem.temperature = event->temp;
	ctx->modem.voltage = event->voltage;
	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback returning the state after modem deinitialization by
 * nrf_modem_dect_phy_deinit.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_DEINIT' event.
 */
static void modem_deinit_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			    const struct nrf_modem_dect_phy_deinit_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_DEINIT", *time);
	} else {
		LOG_ERR("PHY_EVT_DEINIT failed,0x%x", event->err);
	}
	ctx->modem.time = *time;
	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback returning the state after modem configuration by
 * nrf_modem_dect_phy_configure.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_CONFIGURE' event.
 */
static void modem_configure_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			       const struct nrf_modem_dect_phy_configure_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_CONFIGURE success,%d°C,%umV", *time, event->temp,
			event->voltage);
	} else {
		LOG_ERR("PHY_EVT_CONFIGURE failed,0x%x,%d°C,%umV", event->err, event->temp,
			event->voltage);
	}
	ctx->modem.time = *time;
	ctx->modem.temperature = event->temp;
	ctx->modem.voltage = event->voltage;
	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback returning the state after radio configuration by
 * nrf_modem_dect_phy_radio_config.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_RADIO_CONFIG' event.
 */
static void modem_radio_config_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				  const struct nrf_modem_dect_phy_radio_config_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_INF("<%lld> PHY_EVT_RADIO_CONFIG", *time);
	} else {
		LOG_ERR("<%lld> PHY_EVT_RADIO_CONFIG failed,0x%x", *time, event->err);
	}
	ctx->modem.time = *time;
	ctx->modem.last_status = event->err;
}

/**
 * @brief Event callback returning the state after phy activation by nrf_modem_dect_phy_activate.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_ACTIVATE' event.
 */
static void modem_activate_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			      const struct nrf_modem_dect_phy_activate_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_ACTIVATE,%d°C,%umV", *time, event->temp, event->voltage);
	} else {
		LOG_ERR("<%lld> PHY_EVT_ACTIVATE failed,0x%x", *time, event->err);
	}
	ctx->modem.time = *time;
	ctx->modem.temperature = event->temp;
	ctx->modem.voltage = event->voltage;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback returning the state after phy activation by nrf_modem_dect_phy_deactivate.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_DEACTIVATE' event.
 */
static void modem_deactivate_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				const struct nrf_modem_dect_phy_deactivate_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_DEACTIVATE", *time);
	} else {
		LOG_ERR("<%lld> PHY_EVT_DEACTIVATE failed,0x%x", *time, event->err);
	}
	ctx->modem.time = *time;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback notifying modems capabilities requested by
 * nrf_modem_dect_phy_capability_get.
 *
 * * Store supported µ and beta.
 * * Prints the capabilities of the modem.
 * * Store last_status.
 * * Unblocks ctx->modemlock.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_CAPABILITY' event.
 */
static void modem_capability_get_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				    const struct nrf_modem_dect_phy_capability_get_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {

		/* We for now pick mu/beta from one and only variant.
			TODO But if more then one is provided we have to refactore this. */
		__ASSERT_NO_MSG(event->capability->variant_count >= 1);
		ctx->modem.mu = event->capability->variant[0].mu;
		ctx->modem.beta = event->capability->variant[0].beta;

		if (IS_ENABLED(CONFIG_DECTNRP_DRIVER_NRF91X1_CAP_LOGGING)) {

			LOG_WRN("<%lld> PHY_EVT_CAPABILITY,dect-version=%d,variant count=%d", *time,
				event->capability->dect_version, event->capability->variant_count);

			for (uint8_t i = 0; i < event->capability->variant_count; i++) {

				const struct nrf_modem_dect_phy_capability *capability =
					event->capability;
				LOG_WRN(" [%u]", i);
				LOG_WRN(" ├rx spatial streams: %d",
					capability->variant[i].rx_spatial_streams);
				LOG_WRN(" ├rx tx diversity: %d",
					capability->variant[i].rx_tx_diversity);
				LOG_WRN(" ├mcs max: %d", capability->variant[i].mcs_max);
				LOG_WRN(" ├harq soft buf size: %d",
					capability->variant[i].harq_soft_buf_size);
				LOG_WRN(" ├harq process count max: %d",
					capability->variant[i].harq_process_count_max);
				LOG_WRN(" ├harq feedback delay: %d",
					capability->variant[i].harq_feedback_delay);
				LOG_WRN(" ├mu: %d", capability->variant[i].mu);
				LOG_WRN(" └beta: %d", capability->variant[i].beta);
			}
		}
	} else {
		LOG_ERR("<%lld> PHY_EVT_CAPABILITY failed,0x%x", *time, event->err);
	}

	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback notifying supported bands and there parameters requested by
 * nrf_modem_dect_phy_band_get.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * * Prints out band information for each available band.
 * * Store last_status.
 * * Unblocks ctx->modemlock.
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_BANDS' event.
 */
static void modem_band_get_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			      const struct nrf_modem_dect_phy_band_get_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		if (IS_ENABLED(CONFIG_DECTNRP_DRIVER_NRF91X1_CAP_LOGGING)) {
			LOG_WRN("<%lld> %u bands supported:0x%x.", *time, event->band_count,
				event->supported_bands);
			for (uint32_t i = 0; i < event->band_count; i++) {
				struct nrf_modem_dect_phy_band *band = &event->band[i];
				LOG_WRN(" band[%u]", band->band_number);
				LOG_WRN(" ├band group index: %u", band->band_group_index);
				LOG_WRN(" ├rx gain: %d", band->rx_gain);
				LOG_WRN(" ├power class: %u", band->power_class);
				LOG_WRN(" └%u<=carrier<=%u", band->min_carrier, band->max_carrier);
			}
		}
	} else {
		LOG_ERR("<%lld> PHY_EVT_BANDS failed,0x%x", *time, event->err);
	}

	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback notifying modem latencies requested by nrf_modem_dect_phy_latency_get.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * * Prints out latency information.
 * * Store last_status.
 * * Unblocks ctx->modemlock.
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_LATENCY' event.
 */
static void modem_latency_get_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				 const struct nrf_modem_dect_phy_latency_info_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		struct nrf_modem_dect_phy_latency_info *latency_info = event->latency_info;
		if (IS_ENABLED(CONFIG_DECTNRP_DRIVER_NRF91X1_CAP_LOGGING)) {
			LOG_WRN("<%lld> PHY_EVT_LATENCY", *time);
			LOG_WRN(" RX:");
			LOG_WRN(" ├idle_to_active: %u",
				latency_info->operation.receive.idle_to_active);
			LOG_WRN(" ├active_to_idle_rssi: %u",
				latency_info->operation.receive.active_to_idle_rssi);
			LOG_WRN(" ├active_to_idle_rx: %u",
				latency_info->operation.receive.active_to_idle_rx);
			LOG_WRN(" ├active_to_idle_rx_rssi: %u",
				latency_info->operation.receive.active_to_idle_rx_rssi);
			LOG_WRN(" └stop_to_rf_off: %u",
				latency_info->operation.receive.stop_to_rf_off);
			LOG_WRN(" TX:");
			LOG_WRN(" ├idle_to_active: %u",
				latency_info->operation.transmit.idle_to_active);
			LOG_WRN(" └active_to_idle: %u",
				latency_info->operation.transmit.active_to_idle);
			LOG_WRN(" Modem:");
			LOG_WRN(" ├initialization: %u", latency_info->stack.initialization);
			LOG_WRN(" ├deinitialization: %u", latency_info->stack.deinitialization);
			LOG_WRN(" ├configuration: %u", latency_info->stack.configuration);
			LOG_WRN(" ├activation: %u", latency_info->stack.activation);
			LOG_WRN(" └deactivation: %u", latency_info->stack.deactivation);
		}
	} else {
		LOG_ERR("<%lld> PHY_EVT_LATENCY failed,0x%x", *time, event->err);
	}

	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback notifying modem time requested by nrf_modem_dect_phy_time_get.
 *
 * @attention This function should be used in blocking mode, it releases ctx->modemlock!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param status response state.
 */
static void modem_time_get_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			      const enum nrf_modem_dect_phy_err status)
{
	if (status == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld> PHY_EVT_TIME", *time);
		ctx->modem.time = *time;
	} else {
		LOG_ERR("<%lld> PHY_EVT_TIME failed,0x%x", *time, status);
	}

	ctx->modem.last_status = status;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Accumulate rssi1 values measured per symbol to subslots.
 *
 * * Each subslot consists of 5 symbols (µ=1).
 * * The RSSI1 value of one subslot is computed like this: subslot_dbm = MAX(symbol_dbm[0..4])
 * * Values [0..0x73] are mapped to -1.
 *   * 0 = NRF_MODEM_DECT_PHY_RSSI_NOT_MEASURED
 *   * 1..0x73 = according to Nordic - measurement is saturated
 * * If measured rssi1 values do not fit into op->rssi1.result->subslot remaining
 *   data is ignored.
 *
 * @param op
 * @param data
 * @param len
 */
static void rssi1_accumulate(struct dectnrp_driver_op *op, int8_t *data, uint16_t len)
{
	len = MIN(sizeof(op->rssi1.result->subslot) * DECTNRP_SYMBOLS_PER_SUBSLOT, len);
	int16_t max = DECTNRP_RSSI_MIN;

	for (size_t i = 0; i < len; i++) {

		int16_t rssi1 = (int16_t)(0xff00 | data[i]);
		if (rssi1 < DECTNRP_RSSI_MIN) {
			/* If the measurement is saturated, the measured signal strength
			   is reported as a positive integer.
			   If a symbol is not measured, its value is reported
			   as @ref NRF_MODEM_DECT_PHY_RSSI_NOT_MEASURED.
			    -> Limit to DECTNRP_RSSI_MAX */
			rssi1 = DECTNRP_RSSI_MAX;
		}
		max = MAX(max, rssi1);

		if ((i + 1) % DECTNRP_SYMBOLS_PER_SUBSLOT == 0) {
			/* Write maximum rssi1 value of that sub-slot formated according to spec */
			op->rssi1.result->subslot[i / DECTNRP_SYMBOLS_PER_SUBSLOT] = (uint8_t)max;
			max = DECTNRP_RSSI_MIN;
		}
	}
}

/**
 * @brief Event callback notifying rssi1 measurement results requested by nrf_modem_dect_phy_rssi.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param op_complete_event 'NRF_MODEM_DECT_PHY_EVT_RSSI' event.
 */
static void modem_rssi_result(struct nrf91x1_context *ctx, const uint64_t *time,
			      const struct nrf_modem_dect_phy_rssi_event *event)
{
	ARG_UNUSED(ctx);
	struct dectnrp_driver_op *op = (void *)event->handle;
	__ASSERT(op->rssi1.result->subslot != NULL, "Data struct for rssi1 measurements missing!");

	int64_t diff = event->meas_start_time - op->start_time;

	LOG_DBG("<%lld>[0x%x] PHY_EVT_RSSI,rssi1-start-time=%llu,diff<%llu>,"
		"(~%llu frames),mea-start-time=%llu",
		*time, event->handle, op->start_time, diff, diff / FRAME_MODEM_TIME_TICK,
		event->meas_start_time);

	rssi1_accumulate(op, event->meas, event->meas_len);

	return;
}

/**
 * @brief Event callback notifying a received PCC.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param pcc_event 'NRF_MODEM_DECT_PHY_EVT_PCC' event.
 */
static void modem_pcc_received(struct nrf91x1_context *ctx, const uint64_t *time,
			       const struct nrf_modem_dect_phy_pcc_event *event)
{
	int16_t rssi_2 = event->rssi_2;

