Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91x1.c
	LOG_DBG("<%lld>[0x%x] PHY_EVT_PCC,stf_start_time:%llu,phy_type:%d,"
		"rssi_2:%d.%udBm,snr:0x%x",
		*time, event->handle, event->stf_start_time, event->phy_type, rssi_2 / 2,
		(rssi_2 & 0b1) * 5, event->snr);

	if (atomic_test_bit(&ctx->rx.state, RADIO_RXSTATE_PCC)) {
		LOG_WRN("PHY_EVT_PCC overrun,pcc dropped");
		// TODO Event is completly lost, signalize to upper layer.
	} else if (event->header_status == NRF_MODEM_DECT_PHY_HDR_STATUS_INVALID) {
		LOG_WRN("PHY_EVT_PCC,HDR_STATUS_INVALID,dropped");
		// TODO Event is completly lost, signalize to upper layer.
	} else if (event->header_status == NRF_MODEM_DECT_PHY_HDR_STATUS_INVALID) {
		LOG_WRN("PHY_EVT_PCC,HDR_STATUS_VALID_RX_END,dropped");
		// TODO Event is completly lost, signalize to upper layer.
	} else {
		// TODO This gets stored at ctx, maybe it would be better to store it at operation.
		memcpy(&ctx->rx.pcc_event, event, sizeof(*event));
		atomic_set_bit(&ctx->rx.state, RADIO_RXSTATE_PCC);
	}
}

/**
 * @brief Event callback notifying a crc error while receiving PCC.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param crc_failure 'NRF_MODEM_DECT_PHY_EVT_PCC_ERROR' event.
 */
static void modem_pcc_crc_err(struct nrf91x1_context *ctx, const uint64_t *time,
			      const struct nrf_modem_dect_phy_pcc_crc_failure_event *event)
{
	ctx->rx.crc_errors_phy_header++;
	int16_t rssi2 = event->rssi_2;

	LOG_WRN("PHY_EVT_PCC_ERROR,stf_start_time:%llu,rssi_2:%d.%udBm,"
		"snr:0x%x,crc_errors_phy_header:%u",
		event->stf_start_time, rssi2 / 2, (rssi2 & 0b1) * 5, event->snr,
		ctx->rx.crc_errors_phy_header);

	if (ctx->upper_layer_event_handler) {

		struct dectnrp_driver_op *op = (void *)event->handle;

		struct dectnrp_driver_event stack_event = {
			.code = DECTNRP_EVENT_MSG_ERROR,
			.message_error.status = DECTNRP_ERROR_PCC_CRC,
			.message_error.op = op,
			.message_error.start_time = event->stf_start_time,
			.message_error.rssi2_valid =
				(rssi2 != NRF_MODEM_DECT_PHY_RSSI2_NOT_MEASURED),
			.message_error.snr_valid =
				(event->snr != NRF_MODEM_DECT_PHY_SNR_NOT_MEASURED)};

		if (stack_event.message_error.rssi2_valid) {
			/* Transcode rssi2 value */
			stack_event.message_error.rssi2 = dectnrp_nrf91x1_encode_rssi2(rssi2);
		}
		if (stack_event.message_error.snr_valid) {
			/* Transcode snr value */
			stack_event.message_error.snr = dectnrp_nrf91x1_encode_snr(event->snr);
		}

		ctx->upper_layer_event_handler(ctx->iface, &stack_event);
	}
}

/**
 * @brief Event callback notifying a received PDC.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param pdc_event 'NRF_MODEM_DECT_PHY_EVT_PDC' event.
 */
static void modem_pdc_received(struct nrf91x1_context *ctx, const uint64_t *time,
			       const struct nrf_modem_dect_phy_pdc_event *event)
{
	struct dectnrp_driver_op *op = (void *)event->handle;

	int16_t rssi2 = event->rssi_2;
	LOG_DBG("<%lld>[0x%x] PHY_EVT_PDC,len:%u,rssi_2:%d.%udBm,snr:0x%x", *time, event->handle,
		event->len, rssi2 / 2, (rssi2 & 0b1) * 5, event->snr);

	if (!atomic_test_bit(&ctx->rx.state, RADIO_RXSTATE_PCC)) {
		LOG_WRN("PHY_EVT_PDC,!RADIO_RXSTATE_PCC,pdc dropped");
		// TODO Event is completly lost, signalize to upper layer.
	} else if (ctx->rx.pcc_event.transaction_id != event->transaction_id) {
		LOG_WRN("PHY_EVT_PDC,transaction_id mismatch,pdc dropped");
		// TODO Event is completly lost, signalize to upper layer.
	} else {
		atomic_set_bit(&ctx->rx.state, RADIO_RXSTATE_PDC);

		if (ctx->upper_layer_event_handler) {
			struct dectnrp_driver_event stack_event = {
				.code = DECTNRP_EVENT_MSG_RECEIVED,
				.msg_received.op = op,
				.msg_received.phy_type = ctx->rx.pcc_event.phy_type,
				.msg_received.pcc = &ctx->rx.pcc_event.hdr.type_1[0],
				.msg_received.pcc_len = ctx->rx.pcc_event.phy_type == 0
								? DECTNRP_PHY_HEADER_TYPE1_SIZE
								: DECTNRP_PHY_HEADER_TYPE2_SIZE,
				.msg_received.pdc = event->data,
				.msg_received.pdc_len = event->len,
				.msg_received.start_time = ctx->rx.pcc_event.stf_start_time,
				.msg_received.rssi2_valid =
					(rssi2 != NRF_MODEM_DECT_PHY_RSSI2_NOT_MEASURED),
				.msg_received.snr_valid =
					(event->snr != NRF_MODEM_DECT_PHY_SNR_NOT_MEASURED)};

			if (stack_event.msg_received.rssi2_valid) {
				/* Transcode rssi2 value */
				stack_event.msg_received.rssi2 =
					dectnrp_nrf91x1_encode_rssi2(rssi2);
			}
			if (stack_event.msg_received.snr_valid) {
				/* Transcode snr value */
				stack_event.msg_received.snr =
					dectnrp_nrf91x1_encode_snr(event->snr);
			}

			ctx->upper_layer_event_handler(ctx->iface, &stack_event);
		}
	}
}

/**
 * @brief Event callback notifying a crc error while receiving PDC.
 *
 * @attention This function is used in asynchronous mode!
 * * Creates a packet with received PCC only
 * * notifies that packet up to upper layers
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param crc_failure 'NRF_MODEM_DECT_PHY_EVT_PDC_ERROR' event.
 */
static void modem_pdc_crc_err(struct nrf91x1_context *ctx, const uint64_t *time,
			      const struct nrf_modem_dect_phy_pdc_crc_failure_event *event)
{
	struct dectnrp_driver_op *op = (void *)event->handle;

	int16_t rssi2 = event->rssi_2;
	ctx->rx.crc_errors_data++;

	LOG_WRN("PHY_EVT_PDC_ERROR,"
		"rssi_2:%d.%udBm,snr:0x%x,crc_errors_data:%u",
		rssi2 / 2, (rssi2 & 0b1) * 5, event->snr, ctx->rx.crc_errors_data);

	if (!atomic_test_bit(&ctx->rx.state, RADIO_RXSTATE_PCC)) {
		LOG_WRN("PHY_EVT_PDC_ERROR,!RADIO_RXSTATE_PCC,pdc dropped");
		// TODO: FIXME: signalize to higher Layer?
	} else {
		atomic_set_bit(&ctx->rx.state, RADIO_RXSTATE_PDC);

		if (ctx->upper_layer_event_handler) {
			/* PCC Header is good to go to upper layers */
			struct dectnrp_driver_event stack_event = {
				.code = DECTNRP_EVENT_MSG_ERROR,
				.message_error.status = DECTNRP_ERROR_PDC_CRC,
				.message_error.op = op,
				.message_error.pcc_valid = true,
				.message_error.phy_type = ctx->rx.pcc_event.phy_type,
				.message_error.pcc = &ctx->rx.pcc_event.hdr.type_1[0],
				.message_error.start_time = ctx->rx.pcc_event.stf_start_time,
				.message_error.rssi2_valid =
					(rssi2 != NRF_MODEM_DECT_PHY_RSSI2_NOT_MEASURED),
				.message_error.snr_valid =
					(event->snr != NRF_MODEM_DECT_PHY_SNR_NOT_MEASURED)};

			if (stack_event.message_error.rssi2_valid) {
				/* Transcode rssi2 value */
				stack_event.message_error.rssi2 =
					dectnrp_nrf91x1_encode_rssi2(rssi2);
			}
			if (stack_event.message_error.snr_valid) {
				/* Transcode snr value */
				stack_event.message_error.snr =
					dectnrp_nrf91x1_encode_snr(event->snr);
			}

			ctx->upper_layer_event_handler(ctx->iface, &stack_event);
		}
	}
}

/**
 * @brief Event callback notifying completed operations.
 *
 * @attention This function is used in asynchronous mode!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param event 'NRF_MODEM_DECT_PHY_EVT_COMPLETED' event.
 */
static void modem_op_complete_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				 const struct nrf_modem_dect_phy_op_complete_event *event)
{
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_DBG("<%lld>[0x%x] PHY_EVT_COMPLETED,%d°C,%umV", *time, event->handle,
			event->temp, event->voltage);
	} else {
		LOG_INF("<%lld>[0x%x] PHY_EVT_COMPLETED failed,0x%x,%d°C,%umV", *time,
			event->handle, event->err, event->temp, event->voltage);
	}

