Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91x1.c
	struct dectnrp_driver_op *op = (void *)event->handle;

	bool rx = atomic_test_bit(&ctx->rx.state, RADIO_RXSTATE_PDC);
	if (rx) {
		atomic_clear_bit(&ctx->rx.state, RADIO_RXSTATE_PCC);
		atomic_clear_bit(&ctx->rx.state, RADIO_RXSTATE_PDC);
	}

	if (ctx->upper_layer_event_handler) {
		struct dectnrp_driver_event stack_event = {.code = DECTNRP_EVENT_OP_FINISHED,
							   .op_finished.op = op};
		op->status = -event->err; // FIXME use generic error codes
		ctx->upper_layer_event_handler(ctx->iface, &stack_event);
	}
}

/**
 * @brief Event callback notifying status of cancel operation requested by
 * nrf_modem_dect_phy_cancel.
 *
 * @attention This function is used in asynchronous mode!
 * @attention This function does only logging up to now!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param cancel 'NRF_MODEM_DECT_PHY_EVT_CANCELED' event.
 */
static void modem_op_cancel_cb(struct nrf91x1_context *ctx, const uint64_t *time,
			       const struct nrf_modem_dect_phy_cancel_event *event)
{
	switch (event->err) {
	case NRF_MODEM_DECT_PHY_SUCCESS: {
		LOG_DBG("<%lld>[0x%x] PHY_EVT_CANCELED", *time, event->handle);
		if (event->handle != NRF_MODEM_DECT_PHY_HANDLE_CANCEL_ALL) {
			LOG_ERR("PHY_EVT_CANCELED of single operation not supported yet");
			// TODO
			// struct dectnrp_driver_op *op = (void *)event->handle;
		}
		break;
	}
	case NRF_MODEM_DECT_PHY_ERR_UNSUPPORTED_OP: {
		LOG_ERR("PHY_EVT_CANCELED failed, unsupported operation");
		break;
	}
	case NRF_MODEM_DECT_PHY_ERR_NOT_FOUND: {
		LOG_ERR("PHY_EVT_CANCELED failed, handle not found");
		break;
	}
	case NRF_MODEM_DECT_PHY_ERR_NOT_ALLOWED: {
		LOG_ERR("PHY_EVT_CANCELED failed, not allowed");
	}
	default: {
		break;
	}
	}

	ctx->modem.last_status = event->err;
	k_sem_give(&ctx->modemlock);
}

/**
 * @brief Event callback returning the state after configuration of links by
 * nrf_modem_dect_phy_link_config.
 *
 * @attention This function is used in asynchronous mode!
 * @attention This function does only logging up to now!
 *
 * @param ctx The context related to nrf91x1 radio device.
 * @param time Modem time of the event.
 * @param cancel 'NRF_MODEM_DECT_PHY_EVT_CANCELED' event.
 */
static void modem_link_config_cb(struct nrf91x1_context *ctx, const uint64_t *time,
				 const struct nrf_modem_dect_phy_link_config_event *event)
{
	ARG_UNUSED(ctx);
	if (event->err == NRF_MODEM_DECT_PHY_SUCCESS) {
		LOG_WRN("<%lld> PHY_EVT_LINK_CONFIG", *time);
	} else {
		LOG_ERR("<%lld> PHY_EVT_LINK_CONFIG failed,0x%x", *time, event->err);
	}
}

/**
 * @brief Handler for events coming from the modem related to phy.
 *
 * Distributes the events to dedicated handling function using the @p event->id.
 * @attention This function for some events is used in blocking mode, it releases ctx->modemlock!
 *
 * @param event Pointer to the event containing type and event specific information.
 */
static void modem_phy_event_handler(const struct nrf_modem_dect_phy_event *event)
{
	struct nrf91x1_context *ctx = nrf91x1_dev->data;

	LOG_DBG("event id %d", event->id);

	switch (event->id) {
	case NRF_MODEM_DECT_PHY_EVT_INIT: {
		modem_init_cb(ctx, &event->time, &event->init);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_DEINIT: {
		modem_deinit_cb(ctx, &event->time, &event->deinit);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_CONFIGURE: {
		modem_configure_cb(ctx, &event->time, &event->configure);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_RADIO_CONFIG: {
		modem_radio_config_cb(ctx, &event->time, &event->radio_config);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_ACTIVATE: {
		modem_activate_cb(ctx, &event->time, &event->activate);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_DEACTIVATE: {
		modem_deactivate_cb(ctx, &event->time, &event->deactivate);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_CAPABILITY: {
		modem_capability_get_cb(ctx, &event->time, &event->capability_get);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_BANDS: {
		modem_band_get_cb(ctx, &event->time, &event->band_get);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_LATENCY: {
		modem_latency_get_cb(ctx, &event->time, &event->latency_get);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_TIME: {
		modem_time_get_cb(ctx, &event->time, event->time_get.err);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_COMPLETED: {
		modem_op_complete_cb(ctx, &event->time, &event->op_complete);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_CANCELED: {
		modem_op_cancel_cb(ctx, &event->time, &event->cancel);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_RSSI: {
		modem_rssi_result(ctx, &event->time, &event->rssi);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_PCC: {
		modem_pcc_received(ctx, &event->time, &event->pcc);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_PCC_ERROR: {
		modem_pcc_crc_err(ctx, &event->time, &event->pcc_crc_err);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_PDC: {
		modem_pdc_received(ctx, &event->time, &event->pdc);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_PDC_ERROR: {
		modem_pdc_crc_err(ctx, &event->time, &event->pdc_crc_err);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_LINK_CONFIG: {
		modem_link_config_cb(ctx, &event->time, &event->link_config);
		break;
	}
	case NRF_MODEM_DECT_PHY_EVT_STF_CONFIG: {
		if (event->stf_cover_seq_control.err == NRF_MODEM_DECT_PHY_SUCCESS) {
			LOG_WRN("<%lld> PHY_EVT_STF_CONFIG", event->time);
		} else {
			LOG_ERR("<%lld> PHY_EVT_STF_CONFIG failed, 0x%x", event->time,
				event->stf_cover_seq_control.err);
		}
		break;
	}
	default: {
		LOG_ERR("<%lld> Unknown modem event, 0x%x", event->time, event->id);
		break;
	}
	}
}

/**
 * @brief Reads and verifies firmware version from modem.
 *
 * @param[out] mfw_version
 * @return int
 */
static int verify_modem_fw_version(enum nrf91x1_mfw_version *mfw_version)
{

	*mfw_version = RADIO_MFW_UNKNOWN;
	char fw_version_buf[32];

	int ret = nrf_modem_at_cmd(fw_version_buf, sizeof(fw_version_buf), "AT+CGMR");
	if (ret != 0) {
		LOG_ERR("Unable to obtain modem FW version (ERR: %d, ERR TYPE: %d)",
			nrf_modem_at_err(ret), nrf_modem_at_err_type(ret));
		ret = -EIO;
	} else {

		/* Replace "\r\n" against "\0" for printing zero terminated FW version string. */
		char *fw_version_end = strstr(fw_version_buf, "\r\n");
		if (!fw_version_end) {
			LOG_ERR("MFW version:invalid version string");
			ret = -EIO;
		} else {
			*fw_version_end = '\0';
			LOG_WRN("MFW version:%s", fw_version_buf);

